{"class_name": "Functional", "config": {"name": "encoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "QActivation", "config": {"name": "input_qa", "trainable": true, "dtype": "float32", "activation": {"class_name": "quantized_bits", "config": {"bits": 10, "integer": 3, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "__passive_serialization__": true}}, "name": "input_qa", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["input_qa", 0, 0, {}]]]}, {"class_name": "FQDense", "config": {"name": "en_dense_0", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "QInitializer", "config": {"initializer": {"class_name": "HeNormal", "config": {"seed": null}, "__passive_serialization__": true, "shared_object_id": 5}, "use_scale": true, "quantizer": {"class_name": "quantized_bits", "config": {"bits": 8, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 4, "__passive_serialization__": true}}, "shared_object_id": 6}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 7}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "Clip", "config": {"min_value": -2.0, "max_value": 2.0}, "shared_object_id": 8}, "bias_constraint": {"class_name": "Clip", "config": {"min_value": -2.0, "max_value": 2.0}, "shared_object_id": 9}, "kernel_quantizer": {"class_name": "quantized_bits", "config": {"bits": 8, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 4, "__passive_serialization__": true}, "bias_quantizer": {"class_name": "quantized_bits", "config": {"bits": 8, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 4, "__passive_serialization__": true}, "kernel_range": null, "bias_range": null, "ber": 0, "bit_loc": 0}, "name": "en_dense_0", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "FQDense", "config": {"name": "encoded_vector", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "QInitializer", "config": {"initializer": {"class_name": "HeNormal", "config": {"seed": null}, "__passive_serialization__": true, "shared_object_id": 11}, "use_scale": true, "quantizer": {"class_name": "quantized_bits", "config": {"bits": 8, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 4, "__passive_serialization__": true}}, "shared_object_id": 12}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 13}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "Clip", "config": {"min_value": -2.0, "max_value": 2.0}, "shared_object_id": 14}, "bias_constraint": {"class_name": "Clip", "config": {"min_value": -2.0, "max_value": 2.0}, "shared_object_id": 15}, "kernel_quantizer": {"class_name": "quantized_bits", "config": {"bits": 8, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 4, "__passive_serialization__": true}, "bias_quantizer": {"class_name": "quantized_bits", "config": {"bits": 8, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 4, "__passive_serialization__": true}, "kernel_range": null, "bias_range": null, "ber": 0, "bit_loc": 0}, "name": "encoded_vector", "inbound_nodes": [[["en_dense_0", 0, 0, {}]]]}, {"class_name": "QActivation", "config": {"name": "encod_qa", "trainable": true, "dtype": "float32", "activation": {"class_name": "quantized_relu", "config": {"bits": 16, "integer": 6, "use_sigmoid": 0, "negative_slope": 0.0, "use_stochastic_rounding": false, "relu_upper_bound": null, "qnoise_factor": 1.0}, "__passive_serialization__": true}}, "name": "encod_qa", "inbound_nodes": [[["encoded_vector", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["encod_qa", 0, 0]]}, "keras_version": "2.10.0", "backend": "tensorflow"}