{"class_name": "Functional", "config": {"name": "encoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "QActivation", "config": {"name": "input_qa", "trainable": true, "dtype": "float32", "activation": {"class_name": "quantized_bits", "config": {"bits": 11, "integer": 3, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "__passive_serialization__": true}}, "name": "input_qa", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "QConv2D", "config": {"name": "conv2d_0_m", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "QInitializer", "config": {"initializer": {"class_name": "HeNormal", "config": {"seed": null}, "__passive_serialization__": true}, "use_scale": true, "quantizer": {"class_name": "quantized_bits", "config": {"bits": 6, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 3, "__passive_serialization__": true}}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "Clip", "config": {"min_value": -2.0, "max_value": 2.0}}, "bias_constraint": {"class_name": "Clip", "config": {"min_value": -2.0, "max_value": 2.0}}, "kernel_quantizer": {"class_name": "quantized_bits", "config": {"bits": 6, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 3, "__passive_serialization__": true}, "bias_quantizer": {"class_name": "quantized_bits", "config": {"bits": 6, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 3, "__passive_serialization__": true}, "kernel_range": null, "bias_range": null}, "name": "conv2d_0_m", "inbound_nodes": [[["input_qa", 0, 0, {}]]]}, {"class_name": "QActivation", "config": {"name": "accum1_qa", "trainable": true, "dtype": "float32", "activation": {"class_name": "quantized_relu", "config": {"bits": 12, "integer": 3, "use_sigmoid": 0, "negative_slope": 0.0, "use_stochastic_rounding": false, "relu_upper_bound": null, "qnoise_factor": 1.0}, "__passive_serialization__": true}}, "name": "accum1_qa", "inbound_nodes": [[["conv2d_0_m", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["accum1_qa", 0, 0, {}]]]}, {"class_name": "QDense", "config": {"name": "encoded_vector", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "QInitializer", "config": {"initializer": {"class_name": "HeNormal", "config": {"seed": null}, "__passive_serialization__": true, "shared_object_id": 14}, "use_scale": true, "quantizer": {"class_name": "quantized_bits", "config": {"bits": 6, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 13, "__passive_serialization__": true}}, "shared_object_id": 15}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 16}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "Clip", "config": {"min_value": -2.0, "max_value": 2.0}, "shared_object_id": 17}, "bias_constraint": {"class_name": "Clip", "config": {"min_value": -2.0, "max_value": 2.0}, "shared_object_id": 18}, "kernel_quantizer": {"class_name": "quantized_bits", "config": {"bits": 6, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 13, "__passive_serialization__": true}, "bias_quantizer": {"class_name": "quantized_bits", "config": {"bits": 6, "integer": 1, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "shared_object_id": 13, "__passive_serialization__": true}, "kernel_range": null, "bias_range": null}, "name": "encoded_vector", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "QActivation", "config": {"name": "encod_qa", "trainable": true, "dtype": "float32", "activation": {"class_name": "quantized_relu", "config": {"bits": 9, "integer": 1, "use_sigmoid": 0, "negative_slope": 0.0, "use_stochastic_rounding": false, "relu_upper_bound": null, "qnoise_factor": 1.0}, "__passive_serialization__": true}}, "name": "encod_qa", "inbound_nodes": [[["encoded_vector", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["encod_qa", 0, 0]]}, "keras_version": "2.10.0", "backend": "tensorflow"}